app/Controllers/UserData.php

INSERT INTO `userdata` (`file`, `position`, `created_at`, `updated_at`) VALUES ('1683879225_10fbb9ea67b69fee79d5.pdf', 's', '2023-05-12 08:13:45', '2023-05-12 08:13:45')
---
	public function save()
	{
		if (!$this->validate([
			'position' => [
				'rules' => 'required',
				'errors' => [
					'required' => '{field} Tidak boleh kosong'
				]
			],
			'file' => [
				'rules' => 'uploaded[file]|mime_in[file,image/jpg,image/jpeg,image/gif,image/png,application/pdf]|max_size[file,2048]',
				'errors' => [
					'uploaded' => 'Harus Ada File yang diupload',
					'mime_in' => 'File Extention Harus Berupa jpg,jpeg,gif,png',
					'max_size' => 'Ukuran File Maksimal 2 MB'
				]

			]
		])) {
			session()->setFlashdata('error', $this->validator->listErrors());
			return redirect()->back()->withInput();
		}

		$berkas = new UserDataModel();
		$dataBerkas = $this->request->getFile('file');
		$fileName = $dataBerkas->getRandomName();
		$berkas->insert([
			'file' => $fileName,
			'position' => $this->request->getPost('position')
		]);